content/index.org
#+TITLE: Emacs literate configuration
#+PROPERTY: header-args :tangle ../init.el
#+OPTIONS: toc:2 num:nil
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* A foreword on this config and Lisp

Welcome to my literate Emacs configuration. As many specimens of the pedigree,
this config ratifies the Newtonian aphorism involving giants. Many thanks to all the unsung
heroes whose Emacs Lisp snippets assemble the DNA of this file. Apropos of Lisp, I have
recently had a glimpse of the enlightenment promised by so many hacker's lores. Here is one
of my favorites, written by RMS: 

#+BEGIN_VERSE
In days long ago,
When clocks were so slow,
These basic keystrokes
Took too long for folks,
Unless they were writ
In C code to flit.
Today that's not so,
In Lisp they can go.
#+END_VERSE

The beauty of literate configurations with org-mode is that it allows for maintaining an Emacs
config, a website, and an org-mode markup file at the same time. For example, in the header
of this file you can find the following code:

#+begin_src org-mode :tangle no
#+TITLE: Emacs literate configuration
#+PROPERTY: header-args :tangle ../init.el
#+OPTIONS: toc:2 num:nil
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+end_src

With this options, I tangle (every time I save, see the org-mode [[sec:org][hook]]) the source code blocks
in this config to my Emacs =init.el=, and I set up the ReadTheOrg theme that the website uses.

* General configuration

** Add the GNU ELPA and MELPA archives, and then ensure use-package

#+begin_src emacs-lisp
  (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
         ("melpa" . "https://melpa.org/packages/"))
        package-quickstart t)

  (unless (and (fboundp 'package-installed-p)
         (package-installed-p 'use-package))
    (package-initialize)
    (package-refresh-contents)
    (package-install 'use-package))
#+end_src


** One editor to rule them all, one editor to find them

Here I use the =use-package= macro to keep all Emacs internal settings organized in one single block.
The variables have self-explanatory names, but I have added a few comments for the sake of clarity. 

#+begin_src emacs-lisp
  (use-package emacs
    :ensure nil
    :config
    ;; Emacs internal options
    (setq-default initial-scratch-message ";; Welcome Panadestein!!"
                  ring-bell-function #'ignore
                  user-full-name "Ramón L. Panadés-Barrueta, PhD"
                  inhibit-startup-screen t
                  custom-safe-themes t)
    (setq backup-directory-alist
          `(("." . ,(concat user-emacs-directory "backups"))))
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (show-paren-mode 1)
    (fringe-mode '(0 . 0))
    ;; Make ESC close prompts
    (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
    ;; No scroll bar, always full screen
    (add-to-list 'default-frame-alist
                 '(vertical-scroll-bars . nil))
    (add-to-list 'default-frame-alist '(fullscreen . maximized))
    ;; Font
    (add-to-list 'default-frame-alist '(font . "Fira Code-18"))
    ;; Terminal transparency
    (face-spec-set 'default
                   '((((type tty)) :background "unspecified-bg")))
    ;; Line numbers
    (when (version<= "26.0.50" emacs-version)
      (global-display-line-numbers-mode)
      (setq display-line-numbers 'relative))
    ;; Remember line number
    (if (fboundp #'save-place-mode)
        (save-place-mode +1)
      (setq-default save-place t)))
#+end_src

** Prevent custom from messing with my config file

This helps clearing the clutter and increases reproducibility of the config

#+begin_src emacs-lisp
  (let
      ((customization-file (expand-file-name "custom.el" user-emacs-directory)))
    (when (file-exists-p customization-file)
      (setq custom-file customization-file)
      (load custom-file 'noerror)))
#+end_src

** Only highlight programming and text buffers

#+begin_src emacs-lisp
  (use-package hl-line
    :config
    (global-hl-line-mode +1)
    :hook
    (prog-mode . hl-line-mode)
    (text-mode . hl-line-mode))
#+end_src

** Old habits die hard

I cannot just waste years of Vim muscle memory workout. Although the Emacs keybindings
slowly start to /klappt/.

#+begin_src emacs-lisp
  (use-package evil
    :ensure t
    :demand t
    :config
    (evil-mode 1)
    (evil-set-undo-system 'undo-tree)
    ;; This is the cleanest solution for vterm
    (evil-set-initial-state 'vterm-mode 'emacs))
#+end_src

