index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs literate configuration</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Emacs literate configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc47bbc2">A foreword on this config and Lisp</a></li>
<li><a href="#org732670e">General configuration</a>
<ul>
<li><a href="#orge549af5">Add the GNU ELPA and MELPA archives, and then ensure use-package</a></li>
<li><a href="#orgcd543b4">One editor to rule them all, one editor to find them</a></li>
<li><a href="#org763aa1f">Prevent custom from messing with my config file</a></li>
<li><a href="#org9d21ad5">Only highlight programming and text buffers</a></li>
<li><a href="#orge772438">Old habits die hard</a></li>
<li><a href="#org563ad5e">Linear undo system</a></li>
<li><a href="#org29a5dc1">Themes</a></li>
<li><a href="#org7e598dd">Handle very long lines</a></li>
<li><a href="#orgcac6f12">Improved parentheses</a></li>
<li><a href="#org8c9d875">Highlight parentheses with different color</a></li>
<li><a href="#org25a95df">Minimap</a></li>
<li><a href="#orgfa0aaaa">Fancy mode line</a></li>
<li><a href="#org948a76b">Multiple cursors support</a></li>
<li><a href="#org7fdb41d">Tabs-bar-mode</a></li>
</ul>
</li>
<li><a href="#orgd626467">Autocompletion, syntax checking, spell checking and help</a>
<ul>
<li><a href="#org5396478">Complete everything (but code) in Emacs with ivy</a></li>
<li><a href="#org8cfd378">Command's information with which-key</a></li>
<li><a href="#orgc576be8">Improved help system with Helpful</a></li>
<li><a href="#org9d576cd">Code tags</a></li>
<li><a href="#org68885e8">Completion with company</a></li>
<li><a href="#orgdc1dd26">Language serve protocol</a></li>
<li><a href="#org9263029">Spell checking with FlySpell</a></li>
<li><a href="#org758c0c4">Syntax checking with Flycheck</a></li>
<li><a href="#org96723ff">Snippets</a></li>
</ul>
</li>
<li><a href="#org5411542">File browsing and terminals</a>
<ul>
<li><a href="#org6d862b7">Terminal support with Vterm</a></li>
<li><a href="#orgeca424b">File browsers</a></li>
<li><a href="#orgd47c33b">PDF support</a></li>
<li><a href="#org20201b1">TRAMP</a></li>
</ul>
</li>
<li><a href="#org93466c5">Programming</a>
<ul>
<li><a href="#org2294122">Lisp stuff</a></li>
<li><a href="#org24306bf">FORTRAN stuff</a></li>
<li><a href="#orgfc8a32a">IRPF90</a></li>
<li><a href="#org2f36ecb">C/C++ stuff</a></li>
<li><a href="#org8b6db2b">Python stuff</a></li>
<li><a href="#org2f819f0">Cuda stuff</a></li>
<li><a href="#org6380954">Julia stuff</a></li>
<li><a href="#org9bcf7a3">Haskell stuff</a></li>
<li><a href="#org97e527d">Makefile stuff</a></li>
<li><a href="#orgffee5df">Perl stuff</a></li>
<li><a href="#org2928531">Raku stuff</a></li>
<li><a href="#orge031117">Latex</a></li>
<li><a href="#org721b89c">Org-mode stuff</a></li>
<li><a href="#orgfdfbd15">Web stuff</a></li>
<li><a href="#orgb179975">YAML stuff</a></li>
<li><a href="#orgb873533">Markdown stuff</a></li>
<li><a href="#orga36b7e6">reStructuredText stuff</a></li>
<li><a href="#orgbbd4139">Lua stuff</a></li>
<li><a href="#org54a1914">JSON stuff</a></li>
<li><a href="#orgefe3792">Cmake stuff</a></li>
<li><a href="#orgb0e3f4a">Git stuff</a></li>
<li><a href="#org5016946">The heretic Vim stuff</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc47bbc2" class="outline-2">
<h2 id="orgc47bbc2">A foreword on this config and Lisp</h2>
<div class="outline-text-2" id="text-orgc47bbc2">
<p>
Welcome to my literate Emacs configuration. As many specimens of the pedigree,
this config ratifies the Newtonian aphorism involving giants. Many thanks to all the unsung
heroes whose Emacs Lisp snippets assemble the DNA of this file. Apropos of Lisp, I have
recently had a glimpse of the enlightenment promised by so many hacker's lores. Here is one
of my favorites, written by RMS: 
</p>

<p class="verse">
In days long ago,<br />
When clocks were so slow,<br />
These basic keystrokes<br />
Took too long for folks,<br />
Unless they were writ<br />
In C code to flit.<br />
Today that's not so,<br />
In Lisp they can go.<br />
</p>

<p>
The beauty of literate configurations with org-mode is that it allows for maintaining an Emacs
config, a website, and an org-mode markup file at the same time. For example, in the header
of this file you can find the following code:
</p>

<div class="org-src-container">
<pre class="src src-org-mode">#+TITLE: Emacs literate configuration
#+PROPERTY: header-args :tangle ../init.el
#+OPTIONS: toc:2 num:nil
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
</pre>
</div>

<p>
With this options, I tangle (every time I save, see the org-mode <a href="#orgbac126f">hook</a>) the source code blocks
in this config to my Emacs <code>init.el</code>, and I set up the ReadTheOrg theme that the website uses.
</p>
</div>
</div>

<div id="outline-container-org732670e" class="outline-2">
<h2 id="org732670e">General configuration</h2>
<div class="outline-text-2" id="text-org732670e">
</div>
<div id="outline-container-orge549af5" class="outline-3">
<h3 id="orge549af5">Add the GNU ELPA and MELPA archives, and then ensure use-package</h3>
<div class="outline-text-3" id="text-orge549af5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq</span> package-archives '((<span style="color: #8b2252;">"gnu"</span> . <span style="color: #8b2252;">"https://elpa.gnu.org/packages/"</span>)
       (<span style="color: #8b2252;">"melpa"</span> . <span style="color: #8b2252;">"https://melpa.org/packages/"</span>))
      package-quickstart t)

(<span style="color: #a020f0;">unless</span> (<span style="color: #a020f0;">and</span> (fboundp 'package-installed-p)
       (package-installed-p 'use-package))
  (package-initialize)
  (package-refresh-contents)
  (package-install 'use-package))
</pre>
</div>
</div>
</div>


<div id="outline-container-orgcd543b4" class="outline-3">
<h3 id="orgcd543b4">One editor to rule them all, one editor to find them</h3>
<div class="outline-text-3" id="text-orgcd543b4">
<p>
Here I use the <code>use-package</code> macro to keep all Emacs internal settings organized in one single block.
The variables have self-explanatory names, but I have added a few comments for the sake of clarity. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emacs
  <span style="color: #483d8b;">:ensure</span> nil
  <span style="color: #483d8b;">:config</span>
  ;; <span style="color: #b22222;">Emacs internal options</span>
  (<span style="color: #a020f0;">setq-default</span> initial-scratch-message <span style="color: #8b2252;">";; Welcome Panadestein!!"</span>
                ring-bell-function #'ignore
                user-full-name <span style="color: #8b2252;">"Ram&#243;n L. Panad&#233;s-Barrueta, PhD"</span>
                inhibit-startup-screen t
                custom-safe-themes t)
  (<span style="color: #a020f0;">setq</span> backup-directory-alist
        `((<span style="color: #8b2252;">"."</span> . ,(concat user-emacs-directory <span style="color: #8b2252;">"backups"</span>))))
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (show-paren-mode 1)
  (fringe-mode '(0 . 0))
  ;; <span style="color: #b22222;">Make ESC close prompts</span>
  (global-set-key (kbd <span style="color: #8b2252;">"&lt;escape&gt;"</span>) 'keyboard-escape-quit)
  ;; <span style="color: #b22222;">No scroll bar, always full screen</span>
  (add-to-list 'default-frame-alist
               '(vertical-scroll-bars . nil))
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
  ;; <span style="color: #b22222;">Font</span>
  (add-to-list 'default-frame-alist '(font . <span style="color: #8b2252;">"Fira Code-18"</span>))
  ;; <span style="color: #b22222;">Terminal transparency</span>
  (face-spec-set 'default
                 '((((type tty)) <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"unspecified-bg"</span>)))
  ;; <span style="color: #b22222;">Line numbers</span>
  (<span style="color: #a020f0;">when</span> (version&lt;= <span style="color: #8b2252;">"26.0.50"</span> emacs-version)
    (global-display-line-numbers-mode)
    (<span style="color: #a020f0;">setq</span> display-line-numbers 'relative))
  ;; <span style="color: #b22222;">Remember line number</span>
  (<span style="color: #a020f0;">if</span> (fboundp #'save-place-mode)
      (save-place-mode +1)
    (<span style="color: #a020f0;">setq-default</span> save-place t)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org763aa1f" class="outline-3">
<h3 id="org763aa1f">Prevent custom from messing with my config file</h3>
<div class="outline-text-3" id="text-org763aa1f">
<p>
This helps clearing the clutter and increases reproducibility of the config
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">let</span>
    ((customization-file (expand-file-name <span style="color: #8b2252;">"custom.el"</span> user-emacs-directory)))
  (<span style="color: #a020f0;">when</span> (file-exists-p customization-file)
    (<span style="color: #a020f0;">setq</span> custom-file customization-file)
    (load custom-file 'noerror)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d21ad5" class="outline-3">
<h3 id="org9d21ad5">Only highlight programming and text buffers</h3>
<div class="outline-text-3" id="text-org9d21ad5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package hl-line
  <span style="color: #483d8b;">:config</span>
  (global-hl-line-mode +1)
  <span style="color: #483d8b;">:hook</span>
  (prog-mode . hl-line-mode)
  (text-mode . hl-line-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge772438" class="outline-3">
<h3 id="orge772438">Old habits die hard</h3>
<div class="outline-text-3" id="text-orge772438">
<p>
I cannot just waste years of Vim muscle memory workout. Although the Emacs keybindings
slowly start to <i>klappt</i>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package evil
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:demand</span> t
  <span style="color: #483d8b;">:config</span>
  (evil-mode 1)
  (evil-set-undo-system 'undo-tree)
  ;; <span style="color: #b22222;">This is the cleanest solution for vterm</span>
  (evil-set-initial-state 'vterm-mode 'emacs))
</pre>
</div>
</div>
</div>
