content/index.org
** Linear undo system

This is one of the not so awesome quirks of Emacs IMHO. Maybe one day I will understand
its power. I keep it linear for the moment.

#+begin_src emacs-lisp
  (use-package undo-tree
    :ensure t
    :init
    (global-undo-tree-mode))
#+end_src

** Themes

As Nietzsche said, the voice of beauty speaks softly; it creeps only into the most fully awakened souls.
Ergo the importance of a visually pleasant editor. These are my top three themes:

#+begin_src emacs-lisp
  (use-package doom-themes
    :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t
          doom-themes-enable-italic t)
    (load-theme 'doom-vibrant t)
    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-atom")
    (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

  (use-package gruvbox-theme
    :ensure t
    :disabled
    :init (load-theme 'gruvbox-dark-soft t))
  
  (use-package blackboard-theme
    :ensure t
    :disabled
    :init (load-theme 'blackboard t))

  ;; Highlight numbers

  (use-package highlight-numbers
    :ensure t
    :hook
    (prog-mode . highlight-numbers-mode))
#+end_src

** Handle very long lines

Another well-known issue of Emacs, although it rarely affects me.

#+begin_src emacs-lisp
  (use-package so-long
    :ensure t
    :hook
    (after-init-hook . global-so-long-mode))
#+end_src

** Improved parentheses

This helps a lot when lisping.

#+begin_src emacs-lisp
  (use-package smartparens
    :ensure t
    :hook (prog-mode . smartparens-mode))
#+end_src

** Highlight parentheses with different color

Another eye candy. Parenthesis of different colors are very helpful in Lisp though.

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Minimap

This package implements Sublime Text's minimap in Emacs. Although I am quasi-satisfied with
this config, I am not ready to use it on a regular basis.

#+begin_src emacs-lisp
  (use-package minimap
    :ensure nil
    :config
    (setq minimap-window-location 'right)
    (setq minimap-minimum-width 10)
    (setq minimap-dedicated-window t)
    (setq minimap-hide-cursor t)
    (setq minimap-hide-scroll-bar t)
    (setq minimap-hide-fringes t))
#+end_src

** Fancy mode line

Another gift from the Doom Emacs community. Best modeline I have seem for Emacs.
The additional package =all-the-icons= provides awesome icons not only for the
modeline, but also for file managers and many other packages.

#+begin_src emacs-lisp
  (use-package all-the-icons
    ;; Needs a manual `M-x all-the-icons-install-fonts`
    ;; :ensure t
    :load-path "~/.emacs.d/src/all-the-icons/")

  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :config
    (setq doom-modeline-height 40)
    (setq doom-modeline-buffer-file-name-style 'relative-to-project)
    (setq doom-line-numbers-style 'relative)
    (setq doom-modeline-major-mode-icon t)
    (setq doom-modeline-buffer-state-icon t)
    (setq doom-modeline-major-mode-color-icon t))
#+end_src

** Multiple cursors support

This package is very interesting, although not so ergonomic IMHO. Here are some of the
most relevant commands:

- =C-n= make and go to next match
- =C-p= make and go to previous match
- =g r q= stop all cursors

#+begin_src emacs-lisp
  (use-package evil-mc
    :ensure t
    :config
    (global-evil-mc-mode 1))
#+end_src

** Tabs-bar-mode
I could not manage to use this package without side effects in Evil-mode. Here is a simple
usage:

- =C-x t f "filename"= opens file in new tab
- =C-x t 0= closes current tab

#+begin_src emacs-lisp
  (use-package tabbar
    :ensure t
    :bind (("C-<right>" . tabbar-forward)))
#+end_src

* Autocompletion, syntax checking, spell checking and help

