index.html

<div id="outline-container-org563ad5e" class="outline-3">
<h3 id="org563ad5e">Linear undo system</h3>
<div class="outline-text-3" id="text-org563ad5e">
<p>
This is one of the not so awesome quirks of Emacs IMHO. Maybe one day I will understand
its power. I keep it linear for the moment.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package undo-tree
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:init</span>
  (global-undo-tree-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org29a5dc1" class="outline-3">
<h3 id="org29a5dc1">Themes</h3>
<div class="outline-text-3" id="text-org29a5dc1">
<p>
As Nietzsche said, the voice of beauty speaks softly; it creeps only into the most fully awakened souls.
Ergo the importance of a visually pleasant editor. These are my top three themes:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package doom-themes
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  ;; <span style="color: #b22222;">Global settings (defaults)</span>
  (<span style="color: #a020f0;">setq</span> doom-themes-enable-bold t
        doom-themes-enable-italic t)
  (load-theme 'doom-vibrant t)
  ;; <span style="color: #b22222;">Enable flashing mode-line on errors</span>
  (doom-themes-visual-bell-config)
  ;; <span style="color: #b22222;">Enable custom neotree theme (all-the-icons must be installed!)</span>
  (doom-themes-neotree-config)
  ;; <span style="color: #b22222;">or for treemacs users</span>
  (<span style="color: #a020f0;">setq</span> doom-themes-treemacs-theme <span style="color: #8b2252;">"doom-atom"</span>)
  (doom-themes-treemacs-config)
  ;; <span style="color: #b22222;">Corrects (and improves) org-mode's native fontification.</span>
  (doom-themes-org-config))

(use-package gruvbox-theme
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:disabled</span>
  <span style="color: #483d8b;">:init</span> (load-theme 'gruvbox-dark-soft t))

(use-package blackboard-theme
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:disabled</span>
  <span style="color: #483d8b;">:init</span> (load-theme 'blackboard t))

;; <span style="color: #b22222;">Highlight numbers</span>

(use-package highlight-numbers
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:hook</span>
  (prog-mode . highlight-numbers-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e598dd" class="outline-3">
<h3 id="org7e598dd">Handle very long lines</h3>
<div class="outline-text-3" id="text-org7e598dd">
<p>
Another well-known issue of Emacs, although it rarely affects me.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package so-long
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:hook</span>
  (after-init-hook . global-so-long-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcac6f12" class="outline-3">
<h3 id="orgcac6f12">Improved parentheses</h3>
<div class="outline-text-3" id="text-orgcac6f12">
<p>
This helps a lot when lisping.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package smartparens
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:hook</span> (prog-mode . smartparens-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c9d875" class="outline-3">
<h3 id="org8c9d875">Highlight parentheses with different color</h3>
<div class="outline-text-3" id="text-org8c9d875">
<p>
Another eye candy. Parenthesis of different colors are very helpful in Lisp though.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rainbow-delimiters
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:hook</span> (prog-mode . rainbow-delimiters-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org25a95df" class="outline-3">
<h3 id="org25a95df">Minimap</h3>
<div class="outline-text-3" id="text-org25a95df">
<p>
This package implements Sublime Text's minimap in Emacs. Although I am quasi-satisfied with
this config, I am not ready to use it on a regular basis.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package minimap
  <span style="color: #483d8b;">:ensure</span> nil
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> minimap-window-location 'right)
  (<span style="color: #a020f0;">setq</span> minimap-minimum-width 10)
  (<span style="color: #a020f0;">setq</span> minimap-dedicated-window t)
  (<span style="color: #a020f0;">setq</span> minimap-hide-cursor t)
  (<span style="color: #a020f0;">setq</span> minimap-hide-scroll-bar t)
  (<span style="color: #a020f0;">setq</span> minimap-hide-fringes t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfa0aaaa" class="outline-3">
<h3 id="orgfa0aaaa">Fancy mode line</h3>
<div class="outline-text-3" id="text-orgfa0aaaa">
<p>
Another gift from the Doom Emacs community. Best modeline I have seem for Emacs.
The additional package <code>all-the-icons</code> provides awesome icons not only for the
modeline, but also for file managers and many other packages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package all-the-icons
  ;; <span style="color: #b22222;">Needs a manual `M-x all-the-icons-install-fonts`</span>
  ;; <span style="color: #b22222;">:ensure t</span>
  <span style="color: #483d8b;">:load-path</span> <span style="color: #8b2252;">"~/.emacs.d/src/all-the-icons/"</span>)

(use-package doom-modeline
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:init</span> (doom-modeline-mode 1)
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> doom-modeline-height 40)
  (<span style="color: #a020f0;">setq</span> doom-modeline-buffer-file-name-style 'relative-to-project)
  (<span style="color: #a020f0;">setq</span> doom-line-numbers-style 'relative)
  (<span style="color: #a020f0;">setq</span> doom-modeline-major-mode-icon t)
  (<span style="color: #a020f0;">setq</span> doom-modeline-buffer-state-icon t)
  (<span style="color: #a020f0;">setq</span> doom-modeline-major-mode-color-icon t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org948a76b" class="outline-3">
<h3 id="org948a76b">Multiple cursors support</h3>
<div class="outline-text-3" id="text-org948a76b">
<p>
This package is very interesting, although not so ergonomic IMHO. Here are some of the
most relevant commands:
</p>

<ul class="org-ul">
<li><code>C-n</code> make and go to next match</li>
<li><code>C-p</code> make and go to previous match</li>
<li><code>g r q</code> stop all cursors</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package evil-mc
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  (global-evil-mc-mode 1))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7fdb41d" class="outline-3">
<h3 id="org7fdb41d">Tabs-bar-mode</h3>
<div class="outline-text-3" id="text-org7fdb41d">
<p>
I could not manage to use this package without side effects in Evil-mode. Here is a simple
usage:
</p>

<ul class="org-ul">
<li><code>C-x t f "filename"</code> opens file in new tab</li>
<li><code>C-x t 0</code> closes current tab</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package tabbar
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:bind</span> ((<span style="color: #8b2252;">"C-&lt;right&gt;"</span> . tabbar-forward)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd626467" class="outline-2">
<h2 id="orgd626467">Autocompletion, syntax checking, spell checking and help</h2>
<div class="outline-text-2" id="text-orgd626467">
</div>
