index.html
<div id="outline-container-org5396478" class="outline-3">
<h3 id="org5396478">Complete everything (but code) in Emacs with ivy</h3>
<div class="outline-text-3" id="text-org5396478">
<p>
The usage of ivy and their autocompletion army (swiper, counsel) has greatly increased my
productivity. It is also very well integrated with the Doom Emacs theme I use. The swiper
search feature (<code>C-s</code>) is far more powerful than the default Emacs counterpart. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:diminish</span>
  <span style="color: #483d8b;">:bind</span>
  ((<span style="color: #8b2252;">"C-s"</span> . swiper))
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> ivy-use-virtual-buffers t)
  (ivy-mode 1))

(use-package swiper
  <span style="color: #483d8b;">:ensure</span> t)

(use-package counsel
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:after</span> ivy
  <span style="color: #483d8b;">:hook</span>
  (after-init . counsel-mode)
  <span style="color: #483d8b;">:config</span> (counsel-mode)
  <span style="color: #483d8b;">:bind</span>
  (<span style="color: #8b2252;">"M-x"</span> . counsel-M-x)
  (<span style="color: #8b2252;">"C-x b"</span> . counsel-ibuffer)
  (<span style="color: #8b2252;">"C-M-l"</span> . counsel-imenu)
  (<span style="color: #8b2252;">"C-x C-f"</span> . counsel-find-file)
  (<span style="color: #8b2252;">"&lt;f1&gt; v"</span> . counsel-describe-variable)
  (<span style="color: #8b2252;">"&lt;f1&gt; f"</span> . counsel-descbinds-function))

(use-package ivy-prescient
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:after</span> counsel
  <span style="color: #483d8b;">:config</span>
  (ivy-prescient-mode 1))

(use-package ivy-rich
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:init</span>
  (ivy-rich-mode 1)
  <span style="color: #483d8b;">:after</span> counsel
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> ivy-format-function #'ivy-format-function-line)
  (<span style="color: #a020f0;">setq</span> ivy-rich-display-transformers-list
        (plist-put ivy-rich-display-transformers-list
                   'ivy-switch-buffer
                   '(<span style="color: #483d8b;">:columns</span>
                     ((ivy-rich-candidate (<span style="color: #483d8b;">:width</span> 40))
                      (ivy-rich-switch-buffer-indicators
                       (<span style="color: #483d8b;">:width</span> 4 <span style="color: #483d8b;">:face</span> error <span style="color: #483d8b;">:align</span> right))
                      (ivy-rich-switch-buffer-major-mode
                       (<span style="color: #483d8b;">:width</span> 12 <span style="color: #483d8b;">:face</span> warning))
                      (ivy-rich-switch-buffer-project
                       (<span style="color: #483d8b;">:width</span> 15 <span style="color: #483d8b;">:face</span> success))
                      (ivy-rich-switch-buffer-path
                       (<span style="color: #483d8b;">:width</span> (<span style="color: #a020f0;">lambda</span> (x) (ivy-rich-switch-buffer-shorten-path
                                            x (ivy-rich-minibuffer-width 0.3))))))))))

(use-package all-the-icons-ivy
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:demand</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cfd378" class="outline-3">
<h3 id="org8cfd378">Command's information with which-key</h3>
<div class="outline-text-3" id="text-org8cfd378">
<p>
Which-key is a must have to sail the raging seas of Emacs' packages keybindings. This suggestions
come very handy when exploring a new package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package which-key
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:diminish</span>
  <span style="color: #483d8b;">:custom</span>
  (which-key-idle-secondary-delay 0.01)
  (which-key-dont-use-unicode t)
  <span style="color: #483d8b;">:config</span>
  (which-key-mode t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc576be8" class="outline-3">
<h3 id="orgc576be8">Improved help system with Helpful</h3>
<div class="outline-text-3" id="text-orgc576be8">
<p>
Emacs default help system is very good. Helpful makes it awesome by adding colors and source code
exploration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package helpful
  <span style="color: #483d8b;">:custom</span>
  (counsel-describe-variable-function #'helpful-variable)
  <span style="color: #483d8b;">:bind</span>
  (<span style="color: #8b2252;">"C-h f"</span> . helpful-function)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-command] . helpful-command)
  ([remap describe-key] . helpful-key))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d576cd" class="outline-3">
<h3 id="org9d576cd">Code tags</h3>
<div class="outline-text-3" id="text-org9d576cd">
<p>
Using code tags when developing in large scale codes (like electronic structure packages)
can save your fingers from <code>grep</code> induced damage. This package uses the efficient <code>counsel</code>
infrastructure to make tags navigation seamless.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package counsel-etags
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:bind</span> ((<span style="color: #8b2252;">"C-]"</span> . counsel-etags-find-tag-at-point))
  <span style="color: #483d8b;">:init</span>
  (add-hook 'prog-mode-hook
            (<span style="color: #a020f0;">lambda</span> ()
              (add-hook 'after-save-hook
                        'counsel-etags-virtual-update-tags 'append 'local)))
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> counsel-etags-update-interval 60)
  (<span style="color: #a020f0;">push</span> <span style="color: #8b2252;">"build"</span> counsel-etags-ignore-directories))
</pre>
</div>
</div>
</div>

<div id="outline-container-org68885e8" class="outline-3">
<h3 id="org68885e8">Completion with company</h3>
<div class="outline-text-3" id="text-org68885e8">
<p>
Source code completions. An all time classic.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package company
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:init</span>
  (add-hook 'after-init-hook 'global-company-mode)
  (<span style="color: #a020f0;">setq</span> company-minimum-prefix-length 3
        company-selection-wrap-around t
        company-tooltip-limit 20
        company-tooltip-minimum-width 15
        company-tooltip-align-annotations t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc1dd26" class="outline-3">
<h3 id="orgdc1dd26">Language serve protocol</h3>
<div class="outline-text-3" id="text-orgdc1dd26">
<p>
My LSP config is largely work in progress. It includes at the moment Python configuration
and some UI improvements.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lsp-mode
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> lsp-idle-delay 0.5
        lsp-enable-symbol-highlighting t
        lsp-enable-snippet nil
        lsp-pyls-plugins-flake8-enabled t)
  (lsp-register-custom-settings
   '((<span style="color: #8b2252;">"pyls.plugins.pyls_mypy.enabled"</span> nil nil)
     (<span style="color: #8b2252;">"pyls.plugins.pyls_mypy.live_mode"</span> nil t)
     (<span style="color: #8b2252;">"pyls.plugins.pyls_black.enabled"</span> t t)
     (<span style="color: #8b2252;">"pyls.plugins.pyls_isort.enabled"</span> t t)
     ;; <span style="color: #b22222;">Disable duplicated by flake8</span>
     (<span style="color: #8b2252;">"pyls.plugins.pycodestyle.enabled"</span> nil t)
     (<span style="color: #8b2252;">"pyls.plugins.mccabe.enabled"</span> nil t)
     (<span style="color: #8b2252;">"pyls.plugins.pyflakes.enabled"</span> nil t)))
  <span style="color: #483d8b;">:hook</span>
  ((python-mode . lsp)
   (lsp-mode . lsp-enable-which-key-integration)))

(use-package lsp-ui
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> lsp-ui-sideline-show-hover t
        lsp-ui-sideline-delay 0.5
        lsp-ui-doc-delay 5
        lsp-ui-sideline-ignore-duplicates t
        lsp-ui-doc-position 'bottom
        lsp-ui-doc-alignment 'frame
        lsp-ui-doc-header nil
        lsp-ui-doc-include-signature t
        lsp-ui-doc-use-childframe t)
  <span style="color: #483d8b;">:commands</span> lsp-ui-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9263029" class="outline-3">
<h3 id="org9263029">Spell checking with FlySpell</h3>
<div class="outline-text-3" id="text-org9263029">
<p>
FlySpell does a lot out of the box, therefore I have a very basic config.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package flyspell
  <span style="color: #483d8b;">:hook</span>
  ((prog-mode . flyspell-prog-mode)
   (org-mode . turn-on-flyspell))
  <span style="color: #483d8b;">:config</span>
  (flyspell-mode +1))
</pre>
</div>
</div>
</div>
