index.html

<div id="outline-container-org758c0c4" class="outline-3">
<h3 id="org758c0c4">Syntax checking with Flycheck</h3>
<div class="outline-text-3" id="text-org758c0c4">
<p>
Flycheck is another helpful tool. It has some limitations though. For instance, the continuous
checking can harm performance, and some checkers can introduce huge penalties (I had to
disable <code>mypy</code>). With this config I only check when saving.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package flycheck
  <span style="color: #483d8b;">:init</span>
  (<span style="color: #a020f0;">setq-default</span> flycheck-disabled-checkers '(python-mypy))
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> flycheck-check-syntax-automatically '(save mode-enable))
  (<span style="color: #a020f0;">setq</span> flycheck-scheme-chicken-executable <span style="color: #8b2252;">"chicken-csc"</span>)
  <span style="color: #483d8b;">:hook</span>
  (after-init . global-flycheck-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org96723ff" class="outline-3">
<h3 id="org96723ff">Snippets</h3>
<div class="outline-text-3" id="text-org96723ff">
<p>
Yasnippet is a fairly complete collection of snippets with a very intuitive syntax. Painful is the absence
of Scheme snippets. I have written some custom snippets for the IRPF90 derived mode, which I also include
here.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package yasnippet
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  (yas-global-mode 1))

(use-package yasnippet-snippets
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:after</span> yasnippet)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-yasnippet"># -*- mode: snippet -*-
# name: ASSERT 
# key: ass
# --
ASSERT ($0)%
</pre>
</div>

<div class="org-src-container">
<pre class="src src-yasnippet"># -*- mode: snippet -*-
# name: BEGIN_DOC ... END_DOC
# key: bc
# --
BEGIN_DOC
! $0
END_DOC%   
</pre>
</div>

<div class="org-src-container">
<pre class="src src-yasnippet"># -*- mode: snippet -*-
# name: BEGIN_PROVIDER ... END_PROVIDER 
# key: bp
# --
BEGIN_PROVIDER [${1:integer}, ${2:var}]
    $0
END_PROVIDER%  
</pre>
</div>

<div class="org-src-container">
<pre class="src src-yasnippet"># -*- mode: snippet -*-
# -*- mode: snippet -*-
# name: BEGIN_SHELL ... END_SHELL 
# key: bsh
# --
BEGIN_SHELL [ ${1:/bin/bash} ]
    $0
END_SHELL%  
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5411542" class="outline-2">
<h2 id="org5411542">File browsing and terminals</h2>
<div class="outline-text-2" id="text-org5411542">
</div>
<div id="outline-container-org6d862b7" class="outline-3">
<h3 id="org6d862b7">Terminal support with Vterm</h3>
<div class="outline-text-3" id="text-org6d862b7">
<p>
This package uses a C library instead of Lisp to emulate the terminals. It is my favorite emulator
currently, although Eshell could be an alternative.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package vterm
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:preface</span>
  (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my/vterm-mode-hook</span> ()
    (hl-line-mode -1)
    (display-line-numbers-mode -1)
    (display-fill-column-indicator-mode -1)
    (auto-fill-mode -1))
  <span style="color: #483d8b;">:hook</span>
  ((vterm-mode . my/vterm-mode-hook))
  <span style="color: #483d8b;">:custom</span>
  (vterm-kill-buffer-on-exit t)
  (vterm-max-scrollback 10000)
  <span style="color: #483d8b;">:init</span>
  (which-key-add-key-based-replacements <span style="color: #8b2252;">"C-c t"</span> <span style="color: #8b2252;">"term"</span>)
  <span style="color: #483d8b;">:config</span>
  ;; <span style="color: #b22222;">Add find-file-other-window to accepted commands</span>
  (<span style="color: #a020f0;">setq</span> vterm-shell (executable-find <span style="color: #8b2252;">"zsh"</span>))
  (add-to-list 'vterm-eval-cmds
               '(<span style="color: #8b2252;">"find-file-other-window"</span> find-file-other-window)))

(use-package vterm-toggle
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:bind</span> ((<span style="color: #8b2252;">"C-c p"</span> . vterm-toggle-cd)
         <span style="color: #483d8b;">:map</span> vterm-mode-map
         ((<span style="color: #8b2252;">"&lt;C-return&gt;"</span> . vterm-toggle-insert-cd)
          (<span style="color: #8b2252;">"C-M-n"</span> . vterm-toggle-forward)
          (<span style="color: #8b2252;">"C-M-p"</span> . vterm-toggle-backward)))
  <span style="color: #483d8b;">:custom</span>
  (vterm-toggle-scope 'project)
  (vterm-toggle-project-root t)
  (vterm-toggle-fullscreen-p nil)
  <span style="color: #483d8b;">:config</span>
  ;; <span style="color: #b22222;">Show at bottom</span>
  (add-to-list 'display-buffer-alist
               '((<span style="color: #a020f0;">lambda</span>(bufname _)
                   (<span style="color: #a020f0;">with-current-buffer</span> bufname
                     (equal major-mode 'vterm-mode)))
                 ;; <span style="color: #b22222;">(display-buffer-reuse-window display-buffer-at-bottom)</span>
                 (display-buffer-reuse-window display-buffer-in-direction)
                 ;;<span style="color: #b22222;">display-buffer-in-direction/direction/dedicated is added in emacs27</span>
                 (direction . bottom)
                 (dedicated . t) ;<span style="color: #b22222;">dedicated is supported in emacs27</span>
                 (reusable-frames . visible)
                 (window-height . 0.3))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeca424b" class="outline-3">
<h3 id="orgeca424b">File browsers</h3>
<div class="outline-text-3" id="text-orgeca424b">
<p>
After trying a couple of file browsers I understood that all I needed was already there.
Dired keeps me in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ranger
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:disabled</span>
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> ranger-preview-file t))

(use-package neotree
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:bind</span> (<span style="color: #8b2252;">"&lt;f8&gt;"</span> . 'neotree-toggle)
  <span style="color: #483d8b;">:init</span>
  ;; <span style="color: #b22222;">slow rendering</span>
  (<span style="color: #a020f0;">setq</span> inhibit-compacting-font-caches t)
  ;; <span style="color: #b22222;">set icons theme</span>
  (<span style="color: #a020f0;">setq</span> neo-theme (<span style="color: #a020f0;">if</span> (display-graphic-p) 'icons 'arrow))
  (<span style="color: #a020f0;">setq</span> neo-smart-open t))

(use-package all-the-icons-dired
  <span style="color: #483d8b;">:ensure</span> t)

(use-package dired
  ;; <span style="color: #b22222;">TIP: use ( to hide file information</span>
  <span style="color: #483d8b;">:ensure</span> nil
  <span style="color: #483d8b;">:custom</span> ((dired-listing-switches <span style="color: #8b2252;">"-agho --group-directories-first"</span>))
  <span style="color: #483d8b;">:commands</span> (dired dired-jump)
  <span style="color: #483d8b;">:bind</span> ((<span style="color: #8b2252;">"C-x C-j"</span> . dired-jump))
  <span style="color: #483d8b;">:hook</span>
  (dired-mode . all-the-icons-dired-mode)
  <span style="color: #483d8b;">:config</span>
  (evil-define-key 'normal 'dired-mode-map
    <span style="color: #8b2252;">"h"</span> 'dired-single-up-directory
    <span style="color: #8b2252;">"l"</span> 'dired-single-buffer))

(use-package dired-single
  <span style="color: #483d8b;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd47c33b" class="outline-3">
<h3 id="orgd47c33b">PDF support</h3>
<div class="outline-text-3" id="text-orgd47c33b">
<p>
Another C Library, it works better than the default Emacs PDF viewer, for instance it allows hyperlinks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package pdf-tools
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:pin</span> manual
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq-default</span> pdf-view-display-size 'fit-page)
  (<span style="color: #a020f0;">setq</span> pdf-annot-activate-created-annotations t)
  (pdf-tools-install))
</pre>
</div>
</div>
</div>

<div id="outline-container-org20201b1" class="outline-3">
<h3 id="org20201b1">TRAMP</h3>
<div class="outline-text-3" id="text-org20201b1">
<p>
Another must have of Emacs. This packages together with dired saves me from configuring
my editor all the time in obscure supercomputers around the world.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package tramp
  <span style="color: #483d8b;">:ensure</span> t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org93466c5" class="outline-2">
<h2 id="org93466c5">Programming</h2>
<div class="outline-text-2" id="text-org93466c5">
<p>
Here you can find my configuration for different programming languages. I will introduce it
in a laconic manner, because this section is rather opinionated.
</p>
</div>
