content/index.org
** Lisp stuff

The language that give birth to the "Maxwell equations of software"

#+begin_src emacs-lisp
  (use-package lispy
    :ensure t
    :hook ((emacs-lisp-mode . lispy-mode)
           (scheme-mode . lispy-mode)))

  (use-package slime
    :ensure t
    :mode ("\\.lisp\\'" . lisp-mode)
    :init
    (setq slime-net-coding-system 'utf-8-unix
          inferior-lisp-program "sbcl")
    (add-to-list 'slime-contribs 'slime-fancy)
    (add-to-list 'slime-contribs 'slime-repl))

  (use-package geiser
    :ensure t
    :config
    (setq geiser-active-implementations '(chicken)))

  (use-package geiser-chicken
    :ensure t
    :init
    (setq geiser-chicken-binary "chicken-csi"))

  (use-package racket-mode
    :ensure t)

  (use-package hy-mode
    :ensure t
    :mode "\\.hy\\'"
    :commands (hy-mode org-babel-execute:hy)
    :interpreter "hy"
    :hook
    (hy-mode . company-mode)
    (hy-mode . (lambda () (lispy-mode 1)))
    :config
    (add-hook 'hy-mode-hook #'paredit-mode)
    (add-hook 'hy-mode-hook #'rainbow-delimiters-mode))
#+end_src

** FORTRAN stuff

FORTRAN is a major component of my job as a physicist, this package provides all I need. 

#+begin_src emacs-lisp
  (use-package f90-mode
    :mode ("\\.f90\\'")
    :hook
    (f90-mode . (lambda () (setq flycheck-gfortran-args "-ffree-form"))))
#+end_src

** IRPF90

[[http://irpf90.ups-tlse.fr/][IRPF90]] is an environment that allows for efficient functional programming in FORTRAN
using the Implicit Reference to Parameters (IRP) method. I have developed a derived
mode for IRPF90:

#+begin_src emacs-lisp :tangle ../lib/irp-mode.el
  ;;; irp-mode.el --- A major mode for dealing with IRPF90 files

  ;;; Commentary:
  ;; An attempt to support Scemama's IRPF90 in Emacs

  ;;; Code:

  ;; Define IRPF90 extended FORTRAN syntax

  (defvar irp-font-lock-keywords)

  (setq irp-font-lock-keywords
        (let* (
               ;; Define different keywords
               (x-keywords '("BEGIN_PROVIDER" "END_PROVIDER" "ASSERT"
                              "FREE" "PROVIDE" "BEGIN_TEMPLATE"
                              "END_TEMPLATE" "BEGIN_SHELL"
                              "END_SHELL" "IRP_IF" "IRP_ELSE" "TOUCH"
                              "SOFT_TOUCH"))
               (x-types '("double precision" "integer"))
               (x-comments '("BEGIN_DOC" "END_DOC"))

               ;; Generate regex
               (x-keywords-regexp (regexp-opt x-keywords 'words))
               (x-types-regexp (regexp-opt x-types 'words))
               (x-comments-regexp (regexp-opt x-comments 'words)))

          `(
            (,x-types-regexp . font-lock-type-face)
            (,x-keywords-regexp . font-lock-preprocessor-face)
            (,x-comments-regexp . font-lock-comment-face)
            )))

  ;;;###autoload
  (define-derived-mode irp-mode f90-mode "irp mode"
    "Major mode for editing IRPF90 files."
    :syntax-table nil
    :abbrev-table nil
    (font-lock-add-keywords nil irp-font-lock-keywords))

  (provide 'irp-mode)
  ;;; irp-mode.el ends here
#+end_src

This mode can be also configured with =use-package=:

#+begin_src emacs-lisp
  (use-package irp-mode
    :mode ("\\.irp.f\\'")
    :load-path "~/.emacs.d/lib")
#+end_src

** C/C++ stuff

#+begin_src emacs-lisp
  (use-package ccls
    :ensure t
    :hook ((c-mode c++-mode objc-mode cuda-mode) .
           (lambda () (require 'ccls) (lsp)))
    :config
    (setq c-basic-offset 6)
    (setq c-default-style '((java-mode . "java")
                            (awk-mode . "awk")
                            (other . "linux"))))
#+end_src

** Python stuff

#+begin_src emacs-lisp
  (use-package python
    :config
    (setq python-shell-interpreter "jupyter"
          python-shell-interpreter-args "console --simple-prompt"
          python-shell-prompt-detect-failure-warning nil)
    (add-to-list 'python-shell-completion-native-disabled-interpreters "jupyter"))

  (use-package pyvenv
    :ensure t
    :demand t
    :config
    (setq pyvenv-workon "emacs")
    (pyvenv-tracking-mode 1))

  (use-package py-autopep8
    :ensure t
    :config
    (add-hook 'python-mode-hook 'py-autopep8-enable-on-save))
#+end_src

** Cuda stuff

#+begin_src emacs-lisp
  (use-package cuda-mode
      :mode "\\.cu\\'")
#+end_src

** Julia stuff

#+begin_src emacs-lisp
  (use-package julia-mode
    :mode "\\.jl\\'")

  (use-package flycheck-julia
    :hook (julia-mode . flycheck-julia-setup))
#+end_src

** Haskell stuff

#+begin_src emacs-lisp
  (use-package haskell-mode
    :ensure t
    :custom
    (haskell-process-load-or-reload-prompt t)
    (haskell-process-auto-import-loaded-modules t)
    (haskell-process-log t)
    (haskell-tags-on-save t))

  (use-package flycheck-haskell
    :ensure t
    :config
    (setq-default flycheck-disabled-checkers '(haskell-stack-ghc))
    (add-hook 'haskell-mode-hook #'flycheck-haskell-setup))
#+end_src

** Makefile stuff

#+begin_src emacs-lisp
  (use-package make-mode
     :ensure nil)
#+end_src

