index.html

<div id="outline-container-org2294122" class="outline-3">
<h3 id="org2294122">Lisp stuff</h3>
<div class="outline-text-3" id="text-org2294122">
<p>
The language that give birth to the "Maxwell equations of software"
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lispy
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:hook</span> ((emacs-lisp-mode . lispy-mode)
         (scheme-mode . lispy-mode)))

(use-package slime
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:mode</span> (<span style="color: #8b2252;">"\\.lisp\\'"</span> . lisp-mode)
  <span style="color: #483d8b;">:init</span>
  (<span style="color: #a020f0;">setq</span> slime-net-coding-system 'utf-8-unix
        inferior-lisp-program <span style="color: #8b2252;">"sbcl"</span>)
  (add-to-list 'slime-contribs 'slime-fancy)
  (add-to-list 'slime-contribs 'slime-repl))

(use-package geiser
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> geiser-active-implementations '(chicken)))

(use-package geiser-chicken
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:init</span>
  (<span style="color: #a020f0;">setq</span> geiser-chicken-binary <span style="color: #8b2252;">"chicken-csi"</span>))

(use-package racket-mode
  <span style="color: #483d8b;">:ensure</span> t)

(use-package hy-mode
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:mode</span> <span style="color: #8b2252;">"\\.hy\\'"</span>
  <span style="color: #483d8b;">:commands</span> (hy-mode org-babel-execute:hy)
  <span style="color: #483d8b;">:interpreter</span> <span style="color: #8b2252;">"hy"</span>
  <span style="color: #483d8b;">:hook</span>
  (hy-mode . company-mode)
  (hy-mode . (<span style="color: #a020f0;">lambda</span> () (lispy-mode 1)))
  <span style="color: #483d8b;">:config</span>
  (add-hook 'hy-mode-hook #'paredit-mode)
  (add-hook 'hy-mode-hook #'rainbow-delimiters-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org24306bf" class="outline-3">
<h3 id="org24306bf">FORTRAN stuff</h3>
<div class="outline-text-3" id="text-org24306bf">
<p>
FORTRAN is a major component of my job as a physicist, this package provides all I need. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package f90-mode
  <span style="color: #483d8b;">:mode</span> (<span style="color: #8b2252;">"\\.f90\\'"</span>)
  <span style="color: #483d8b;">:hook</span>
  (f90-mode . (<span style="color: #a020f0;">lambda</span> () (<span style="color: #a020f0;">setq</span> flycheck-gfortran-args <span style="color: #8b2252;">"-ffree-form"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc8a32a" class="outline-3">
<h3 id="orgfc8a32a">IRPF90</h3>
<div class="outline-text-3" id="text-orgfc8a32a">
<p>
<a href="http://irpf90.ups-tlse.fr/">IRPF90</a> is an environment that allows for efficient functional programming in FORTRAN
using the Implicit Reference to Parameters (IRP) method. I have developed a derived
mode for IRPF90:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;;; <span style="color: #b22222;">irp-mode.el --- A major mode for dealing with IRPF90 files</span>

;;; <span style="color: #b22222;">Commentary:</span>
;; <span style="color: #b22222;">An attempt to support Scemama's IRPF90 in Emacs</span>

;;; <span style="color: #b22222;">Code:</span>

;; <span style="color: #b22222;">Define IRPF90 extended FORTRAN syntax</span>

(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">irp-font-lock-keywords</span>)

(<span style="color: #a020f0;">setq</span> irp-font-lock-keywords
      (<span style="color: #a020f0;">let*</span> (
             ;; <span style="color: #b22222;">Define different keywords</span>
             (x-keywords '(<span style="color: #8b2252;">"BEGIN_PROVIDER"</span> <span style="color: #8b2252;">"END_PROVIDER"</span> <span style="color: #8b2252;">"ASSERT"</span>
                            <span style="color: #8b2252;">"FREE"</span> <span style="color: #8b2252;">"PROVIDE"</span> <span style="color: #8b2252;">"BEGIN_TEMPLATE"</span>
                            <span style="color: #8b2252;">"END_TEMPLATE"</span> <span style="color: #8b2252;">"BEGIN_SHELL"</span>
                            <span style="color: #8b2252;">"END_SHELL"</span> <span style="color: #8b2252;">"IRP_IF"</span> <span style="color: #8b2252;">"IRP_ELSE"</span> <span style="color: #8b2252;">"TOUCH"</span>
                            <span style="color: #8b2252;">"SOFT_TOUCH"</span>))
             (x-types '(<span style="color: #8b2252;">"double precision"</span> <span style="color: #8b2252;">"integer"</span>))
             (x-comments '(<span style="color: #8b2252;">"BEGIN_DOC"</span> <span style="color: #8b2252;">"END_DOC"</span>))

             ;; <span style="color: #b22222;">Generate regex</span>
             (x-keywords-regexp (regexp-opt x-keywords 'words))
             (x-types-regexp (regexp-opt x-types 'words))
             (x-comments-regexp (regexp-opt x-comments 'words)))

        `(
          (,x-types-regexp . font-lock-type-face)
          (,x-keywords-regexp . font-lock-preprocessor-face)
          (,x-comments-regexp . font-lock-comment-face)
          )))

;;;<span style="color: #b22222;">###</span><span style="color: #ff0000;">autoload</span>
(<span style="color: #a020f0;">define-derived-mode</span> <span style="color: #0000ff;">irp-mode</span> f90-mode <span style="color: #8b2252;">"irp mode"</span>
  <span style="color: #8b2252;">"Major mode for editing IRPF90 files."</span>
  <span style="color: #483d8b;">:syntax-table</span> nil
  <span style="color: #483d8b;">:abbrev-table</span> nil
  (font-lock-add-keywords nil irp-font-lock-keywords))

(<span style="color: #a020f0;">provide</span> '<span style="color: #008b8b;">irp-mode</span>)
;;; <span style="color: #b22222;">irp-mode.el ends here</span>
</pre>
</div>

<p>
This mode can be also configured with <code>use-package</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package irp-mode
  <span style="color: #483d8b;">:mode</span> (<span style="color: #8b2252;">"\\.irp.f\\'"</span>)
  <span style="color: #483d8b;">:load-path</span> <span style="color: #8b2252;">"~/.emacs.d/lib"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f36ecb" class="outline-3">
<h3 id="org2f36ecb">C/C++ stuff</h3>
<div class="outline-text-3" id="text-org2f36ecb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ccls
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:hook</span> ((c-mode c++-mode objc-mode cuda-mode) .
         (<span style="color: #a020f0;">lambda</span> () (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">ccls</span>) (lsp)))
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> c-basic-offset 6)
  (<span style="color: #a020f0;">setq</span> c-default-style '((java-mode . <span style="color: #8b2252;">"java"</span>)
                          (awk-mode . <span style="color: #8b2252;">"awk"</span>)
                          (other . <span style="color: #8b2252;">"linux"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b6db2b" class="outline-3">
<h3 id="org8b6db2b">Python stuff</h3>
<div class="outline-text-3" id="text-org8b6db2b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package python
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> python-shell-interpreter <span style="color: #8b2252;">"jupyter"</span>
        python-shell-interpreter-args <span style="color: #8b2252;">"console --simple-prompt"</span>
        python-shell-prompt-detect-failure-warning nil)
  (add-to-list 'python-shell-completion-native-disabled-interpreters <span style="color: #8b2252;">"jupyter"</span>))

(use-package pyvenv
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:demand</span> t
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq</span> pyvenv-workon <span style="color: #8b2252;">"emacs"</span>)
  (pyvenv-tracking-mode 1))

(use-package py-autopep8
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  (add-hook 'python-mode-hook 'py-autopep8-enable-on-save))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f819f0" class="outline-3">
<h3 id="org2f819f0">Cuda stuff</h3>
<div class="outline-text-3" id="text-org2f819f0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package cuda-mode
    <span style="color: #483d8b;">:mode</span> <span style="color: #8b2252;">"\\.cu\\'"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6380954" class="outline-3">
<h3 id="org6380954">Julia stuff</h3>
<div class="outline-text-3" id="text-org6380954">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package julia-mode
  <span style="color: #483d8b;">:mode</span> <span style="color: #8b2252;">"\\.jl\\'"</span>)

(use-package flycheck-julia
  <span style="color: #483d8b;">:hook</span> (julia-mode . flycheck-julia-setup))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9bcf7a3" class="outline-3">
<h3 id="org9bcf7a3">Haskell stuff</h3>
<div class="outline-text-3" id="text-org9bcf7a3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package haskell-mode
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:custom</span>
  (haskell-process-load-or-reload-prompt t)
  (haskell-process-auto-import-loaded-modules t)
  (haskell-process-log t)
  (haskell-tags-on-save t))

(use-package flycheck-haskell
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  (<span style="color: #a020f0;">setq-default</span> flycheck-disabled-checkers '(haskell-stack-ghc))
  (add-hook 'haskell-mode-hook #'flycheck-haskell-setup))
</pre>
</div>
</div>
</div>

<div id="outline-container-org97e527d" class="outline-3">
<h3 id="org97e527d">Makefile stuff</h3>
<div class="outline-text-3" id="text-org97e527d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package make-mode
   <span style="color: #483d8b;">:ensure</span> nil)
</pre>
</div>
</div>
</div>
