content/index.org
** Perl stuff

#+begin_src emacs-lisp
  (use-package cperl-mode
    :mode ("\\.\\([pP][Llm]\\|al\\)\\'" . cperl-mode))
#+end_src

** Raku stuff

#+begin_src emacs-lisp
  (use-package raku-mode
    :ensure t
    :defer t
    :mode "\\.raku\\'")
#+end_src

** Latex

Auctex provides all you will ever need to work with Latex, and more. 

#+begin_src emacs-lisp
  (use-package auctex
    :ensure t
    :mode ("\\.tex\\'" . latex-mode)
    :commands (latex-mode LaTeX-mode plain-tex-mode)
    :init
    (progn
      (add-hook 'LaTeX-mode-hook #'LaTeX-preview-setup)
      (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
      (add-hook 'LaTeX-mode-hook #'flyspell-mode)
      (add-hook 'LaTeX-mode-hook #'turn-on-reftex)
      (setq TeX-auto-save t
            TeX-parse-self t
            TeX-save-query nil
            TeX-PDF-mode t)))
#+end_src

** Org-mode stuff
<<sec:org>>

Org-mode is the package allowing me to have this literate configuration. Org-superstar
makes org-mode files look gorgeous.

#+begin_src emacs-lisp
   (use-package org-tempo
     :after org
     :hook
     (org-mode . (lambda () (add-hook 'after-save-hook #'org-babel-tangle :append :local)))
     :config
     (add-to-list 'org-modules 'org-tempo)
     (org-babel-do-load-languages
      'org-babel-load-languages '((fortran . t)
                                  (python . t)
                                  (C . t)
                                  (gnuplot . t)
                                  (awk . t)
                                  (latex . t)
                                  (shell . t)))
     (setq org-preview-latex-default-process 'imagemagick)
     (setq org-startup-indented t)
     (setq org-startup-with-inline-images t))

   (use-package org-superstar
     :ensure t
     :config
     (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))
#+end_src

#+RESULTS:
: t

** Web stuff

#+begin_src emacs-lisp
  (use-package php-mode
    :mode ("\\.php\\'"))

  (use-package web-mode
    :ensure t
    :defer t
    :mode ("\\.html\\'" "\\.htm\\'" "\\.css\\'")
    :bind (("C-c C-v" . browse-url-of-buffer))
    :hook
    ((web-mode . company-mode)
     (web-mode . emmet-mode)
     (web-mode . (lambda () (flyspell-mode 1)))
     (web-mode . webmd-hooks-mine)))

  (defun web-mode-flyspefll-verify ()
    "Make flyspell behave correctly in web mode."
    (let ((f (get-text-property (- (point) 1) 'face)))
      (not (memq f '(web-mode-html-attr-value-face
                     web-mode-html-tag-face
                     web-mode-html-attr-name-face
                     web-mode-doctype-face
                     web-mode-keyword-face
                     web-mode-function-name-face
                     web-mode-variable-name-face
                     web-mode-css-property-name-face
                     web-mode-css-selector-face
                     web-mode-css-color-face
                     web-mode-type-face)
                 ))))
  (put 'web-mode 'flyspell-mode-predicate 'web-mode-flyspefll-verify)

  (use-package emmet-mode
    :ensure t)

  (defun webmd-hooks-mine ()
    "Some hooks for web mode."
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-enable-current-column-highlight t)
    (setq web-mode-enable-current-element-highlight t)
    (set-face-attribute 'web-mode-html-tag-bracket-face nil :foreground "red"))

  (use-package js-mode :ensure nil
    :mode ("\\.js\\'"))

  (use-package simple-httpd
    :ensure t)
#+end_src

** YAML stuff

#+begin_src emacs-lisp
  (use-package yaml-mode
    :ensure t
    :mode "\.ya?ml\'")
#+end_src

** Markdown stuff

#+begin_src emacs-lisp
  (use-package markdown-mode
    :ensure t
    :init
    (setq-default markdown-hide-markup t))
#+end_src

** reStructuredText stuff

#+begin_src emacs-lisp
  (use-package rst
    :mode ("\\.rst\\'" . rst-mode)
    :bind (:map rst-mode-map
                ("M-a" . rst-backward-section)
                ("M-e" . rst-forward-section))
    :init
    (setq rst-indent-width 2))
#+end_src

** Lua stuff

#+begin_src emacs-lisp
  (use-package lua-mode
    :ensure t)
#+end_src

** JSON stuff

#+begin_src emacs-lisp
  (use-package json-mode
    :mode "\\.json\\'")

  (use-package flymake-json
    :hook (json-mode . flymake-json-load))
#+end_src

** Cmake stuff

#+begin_src emacs-lisp
  (use-package cmake-mode
    :mode ("CMakeLists\\.txt\\'" "\\.cmake\(.in\)?\\'")
    :config
    (add-to-list 'company-backends 'company-cmake))

  (use-package eldoc-cmake
    :after company
    :hook (cmake-mode . eldoc-cmake-enable))
#+end_src

** Git stuff

This porcelain is more glorious than the one from Meissen

#+begin_src emacs-lisp
(use-package magit
  :ensure t)
#+end_src

** The heretic Vim stuff

#+begin_src emacs-lisp
(use-package vimrc-mode
  :ensure t)
#+end_src
