index.html

<div id="outline-container-orgffee5df" class="outline-3">
<h3 id="orgffee5df">Perl stuff</h3>
<div class="outline-text-3" id="text-orgffee5df">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package cperl-mode
  <span style="color: #483d8b;">:mode</span> (<span style="color: #8b2252;">"\\.</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">[pP][Llm]</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">|</span><span style="color: #8b2252;">al</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252;">\\'"</span> . cperl-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2928531" class="outline-3">
<h3 id="org2928531">Raku stuff</h3>
<div class="outline-text-3" id="text-org2928531">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package raku-mode
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:defer</span> t
  <span style="color: #483d8b;">:mode</span> <span style="color: #8b2252;">"\\.raku\\'"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge031117" class="outline-3">
<h3 id="orge031117">Latex</h3>
<div class="outline-text-3" id="text-orge031117">
<p>
Auctex provides all you will ever need to work with Latex, and more. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package auctex
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:mode</span> (<span style="color: #8b2252;">"\\.tex\\'"</span> . latex-mode)
  <span style="color: #483d8b;">:commands</span> (latex-mode LaTeX-mode plain-tex-mode)
  <span style="color: #483d8b;">:init</span>
  (<span style="color: #a020f0;">progn</span>
    (add-hook 'LaTeX-mode-hook #'LaTeX-preview-setup)
    (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
    (add-hook 'LaTeX-mode-hook #'flyspell-mode)
    (add-hook 'LaTeX-mode-hook #'turn-on-reftex)
    (<span style="color: #a020f0;">setq</span> TeX-auto-save t
          TeX-parse-self t
          TeX-save-query nil
          TeX-PDF-mode t)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org721b89c" class="outline-3">
<h3 id="org721b89c">Org-mode stuff</h3>
<div class="outline-text-3" id="text-org721b89c">
<p>
<a id="orgbac126f"></a>
</p>

<p>
Org-mode is the package allowing me to have this literate configuration. Org-superstar
makes org-mode files look gorgeous.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-tempo
  <span style="color: #483d8b;">:after</span> org
  <span style="color: #483d8b;">:hook</span>
  (org-mode . (<span style="color: #a020f0;">lambda</span> () (add-hook 'after-save-hook #'org-babel-tangle <span style="color: #483d8b;">:append</span> <span style="color: #483d8b;">:local</span>)))
  <span style="color: #483d8b;">:config</span>
  (add-to-list 'org-modules 'org-tempo)
  (org-babel-do-load-languages
   'org-babel-load-languages '((fortran . t)
                               (python . t)
                               (C . t)
                               (gnuplot . t)
                               (awk . t)
                               (latex . t)
                               (shell . t)))
  (<span style="color: #a020f0;">setq</span> org-preview-latex-default-process 'imagemagick)
  (<span style="color: #a020f0;">setq</span> org-startup-indented t)
  (<span style="color: #a020f0;">setq</span> org-startup-with-inline-images t))

(use-package org-superstar
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  (add-hook 'org-mode-hook (<span style="color: #a020f0;">lambda</span> () (org-superstar-mode 1))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfdfbd15" class="outline-3">
<h3 id="orgfdfbd15">Web stuff</h3>
<div class="outline-text-3" id="text-orgfdfbd15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package php-mode
  <span style="color: #483d8b;">:mode</span> (<span style="color: #8b2252;">"\\.php\\'"</span>))

(use-package web-mode
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:defer</span> t
  <span style="color: #483d8b;">:mode</span> (<span style="color: #8b2252;">"\\.html\\'"</span> <span style="color: #8b2252;">"\\.htm\\'"</span> <span style="color: #8b2252;">"\\.css\\'"</span>)
  <span style="color: #483d8b;">:bind</span> ((<span style="color: #8b2252;">"C-c C-v"</span> . browse-url-of-buffer))
  <span style="color: #483d8b;">:hook</span>
  ((web-mode . company-mode)
   (web-mode . emmet-mode)
   (web-mode . (<span style="color: #a020f0;">lambda</span> () (flyspell-mode 1)))
   (web-mode . webmd-hooks-mine)))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">web-mode-flyspefll-verify</span> ()
  <span style="color: #8b2252;">"Make flyspell behave correctly in web mode."</span>
  (<span style="color: #a020f0;">let</span> ((f (get-text-property (- (point) 1) 'face)))
    (not (memq f '(web-mode-html-attr-value-face
                   web-mode-html-tag-face
                   web-mode-html-attr-name-face
                   web-mode-doctype-face
                   web-mode-keyword-face
                   web-mode-function-name-face
                   web-mode-variable-name-face
                   web-mode-css-property-name-face
                   web-mode-css-selector-face
                   web-mode-css-color-face
                   web-mode-type-face)
               ))))
(put 'web-mode 'flyspell-mode-predicate 'web-mode-flyspefll-verify)

(use-package emmet-mode
  <span style="color: #483d8b;">:ensure</span> t)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">webmd-hooks-mine</span> ()
  <span style="color: #8b2252;">"Some hooks for web mode."</span>
  (<span style="color: #a020f0;">setq</span> web-mode-markup-indent-offset 2)
  (<span style="color: #a020f0;">setq</span> web-mode-css-indent-offset 2)
  (<span style="color: #a020f0;">setq</span> web-mode-code-indent-offset 2)
  (<span style="color: #a020f0;">setq</span> web-mode-enable-current-column-highlight t)
  (<span style="color: #a020f0;">setq</span> web-mode-enable-current-element-highlight t)
  (set-face-attribute 'web-mode-html-tag-bracket-face nil <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"red"</span>))

(use-package js-mode <span style="color: #483d8b;">:ensure</span> nil
  <span style="color: #483d8b;">:mode</span> (<span style="color: #8b2252;">"\\.js\\'"</span>))

(use-package simple-httpd
  <span style="color: #483d8b;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb179975" class="outline-3">
<h3 id="orgb179975">YAML stuff</h3>
<div class="outline-text-3" id="text-orgb179975">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package yaml-mode
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:mode</span> <span style="color: #8b2252;">"</span><span style="color: #ff0000;">\</span><span style="color: #8b2252;">.ya?ml</span><span style="color: #ff0000;">\</span><span style="color: #8b2252;">'"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb873533" class="outline-3">
<h3 id="orgb873533">Markdown stuff</h3>
<div class="outline-text-3" id="text-orgb873533">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package markdown-mode
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:init</span>
  (<span style="color: #a020f0;">setq-default</span> markdown-hide-markup t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga36b7e6" class="outline-3">
<h3 id="orga36b7e6">reStructuredText stuff</h3>
<div class="outline-text-3" id="text-orga36b7e6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rst
  <span style="color: #483d8b;">:mode</span> (<span style="color: #8b2252;">"\\.rst\\'"</span> . rst-mode)
  <span style="color: #483d8b;">:bind</span> (<span style="color: #483d8b;">:map</span> rst-mode-map
              (<span style="color: #8b2252;">"M-a"</span> . rst-backward-section)
              (<span style="color: #8b2252;">"M-e"</span> . rst-forward-section))
  <span style="color: #483d8b;">:init</span>
  (<span style="color: #a020f0;">setq</span> rst-indent-width 2))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbd4139" class="outline-3">
<h3 id="orgbbd4139">Lua stuff</h3>
<div class="outline-text-3" id="text-orgbbd4139">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lua-mode
  <span style="color: #483d8b;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org54a1914" class="outline-3">
<h3 id="org54a1914">JSON stuff</h3>
<div class="outline-text-3" id="text-org54a1914">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package json-mode
  <span style="color: #483d8b;">:mode</span> <span style="color: #8b2252;">"\\.json\\'"</span>)

(use-package flymake-json
  <span style="color: #483d8b;">:hook</span> (json-mode . flymake-json-load))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgefe3792" class="outline-3">
<h3 id="orgefe3792">Cmake stuff</h3>
<div class="outline-text-3" id="text-orgefe3792">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package cmake-mode
  <span style="color: #483d8b;">:mode</span> (<span style="color: #8b2252;">"CMakeLists\\.txt\\'"</span> <span style="color: #8b2252;">"\\.cmake</span><span style="color: #ff0000;">\</span><span style="color: #8b2252;">(.in</span><span style="color: #ff0000;">\</span><span style="color: #8b2252;">)?\\'"</span>)
  <span style="color: #483d8b;">:config</span>
  (add-to-list 'company-backends 'company-cmake))

(use-package eldoc-cmake
  <span style="color: #483d8b;">:after</span> company
  <span style="color: #483d8b;">:hook</span> (cmake-mode . eldoc-cmake-enable))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb0e3f4a" class="outline-3">
<h3 id="orgb0e3f4a">Git stuff</h3>
<div class="outline-text-3" id="text-orgb0e3f4a">
<p>
This porcelain is more glorious than the one from Meissen
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package magit
  <span style="color: #483d8b;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5016946" class="outline-3">
<h3 id="org5016946">The heretic Vim stuff</h3>
<div class="outline-text-3" id="text-org5016946">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package vimrc-mode
  <span style="color: #483d8b;">:ensure</span> t)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
